Documents/УпрОбменВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>УпрОбменВалют</Name>
			<Comment>(упр)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УпрДенежныеСредства</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.УпрДвиженияДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Comment>(упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаПолучатель</Name>
					<Comment>(упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОтправлено</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОтправлено</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачено</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПолучено</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПолучено</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/УпрДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>УпрДенежныеСредства</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте банковского счета (кассы)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/УпрДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>УпрДвиженияДенежныхСредств</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте банковского счета (кассы)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриходРасход</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийПриходРасход</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ОбъявлениеНаВзносНаличными</v8:Type>
						<v8:Type>cfg:DocumentRef.ДенежныйЧек</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланированияПлатежа</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланируемоеПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчетовСКонтрагентом</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаОтПокупателяПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДенежныхСредств</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДвиженийПриходРасход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДвиженийПриходРасход</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УпрОбменВалют/Ext/ObjectModule.bsl
// Текущие курс и кратность валюты документа для расчетов
Перем КурсДокумента Экспорт;
Перем КратностьДокумента Экспорт;

Перем мУдалятьДвижения;

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура;

КонецФункции // ПолучитьТаблицуПечатныхФорм()

// Формирует структуру полей, обязательных для заполнения при отражении движения средств.
//
// Возвращаемое значение:
//   СтруктураОбязательныхПолей   – структура для проверки
//
Функция СтруктураОбязательныхПолей()

	СтруктураПолей=Новый Структура;
	СтруктураПолей.Вставить("ОрганизацияОтправитель");
	СтруктураПолей.Вставить("ОрганизацияПолучатель");
	СтруктураПолей.Вставить("Касса");
	СтруктураПолей.Вставить("КассаПолучатель");
	СтруктураПолей.Вставить("СуммаОтправлено");
	СтруктураПолей.Вставить("СуммаПолучено");

	Возврат СтруктураПолей;

КонецФункции // СтруктураОбязательныхПолейОплатаУпр()

// Формирует движения по регистрам
// СтруктураКурсыВалют - структура, содержащая курсы необходимых для расчетов валют.
//
Процедура ДвиженияПоРегистрам(СтруктураКурсыВалют)
	
	СуммаУпрОтправлено = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаОтправлено, СтруктураКурсыВалют.ВалютаОтправлено,
			СтруктураКурсыВалют.ВалютаУпрУчета, 
			СтруктураКурсыВалют.ВалютаОтправленоКурс,
			СтруктураКурсыВалют.ВалютаУпрУчетаКурс, 
			СтруктураКурсыВалют.ВалютаОтправленоКратность,
			СтруктураКурсыВалют.ВалютаУпрУчетаКратность);
			
	СуммаУпрПолучено = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаПолучено, СтруктураКурсыВалют.ВалютаПолучено,
			СтруктураКурсыВалют.ВалютаУпрУчета, 
			СтруктураКурсыВалют.ВалютаПолученоКурс,
			СтруктураКурсыВалют.ВалютаУпрУчетаКурс, 
			СтруктураКурсыВалют.ВалютаПолученоКратность,
			СтруктураКурсыВалют.ВалютаУпрУчетаКратность);
	
	// По регистру "Денежные средства к получению"
	
	//ТаблицаДенежныеСредстваКПолучению = Движения.ДенежныеСредстваКПолучению.ВыгрузитьКолонки();

	//СтрокаДвижений = ТаблицаДенежныеСредстваКПолучению.Добавить();
	//
	//СтрокаДвижений.Организация         				= ОрганизацияПолучатель;
	//СтрокаДвижений.БанковскийСчетКасса 				= КассаПолучатель;
	//СтрокаДвижений.ВидДенежныхСредств  				= Перечисления.ВидыДенежныхСредств.Наличные;
	//СтрокаДвижений.Сумма               				= СуммаДокумента;
	//СтрокаДвижений.СуммаУпр            				= СуммаУпр;
	//СтрокаДвижений.ДокументПолучения   				= Ссылка;	
	//СтрокаДвижений.СтатьяДвиженияДенежныхСредств 	= СтатьяДвиженияДенежныхСредств;
	//
	//Движения.ДенежныеСредстваКПолучению.мПериод          = Дата;
	//Движения.ДенежныеСредстваКПолучению.мТаблицаДвижений = ТаблицаДенежныеСредстваКПолучению;
	//Движения.ДенежныеСредстваКПолучению.ВыполнитьПриход();
	
	// По регистру "Денежные средства к списанию"
	
	//ТаблицаДенежныеСредстваКСписанию = Движения.ДенежныеСредстваКСписанию.ВыгрузитьКолонки();

	//СтрокаДвижений = ТаблицаДенежныеСредстваКСписанию.Добавить();
	//
	//СтрокаДвижений.Организация         				= ОрганизацияОтправитель;
	//СтрокаДвижений.БанковскийСчетКасса 				= Касса;
	//СтрокаДвижений.ВидДенежныхСредств  				= Перечисления.ВидыДенежныхСредств.Наличные;
	//СтрокаДвижений.Сумма               				= СуммаДокумента;
	//СтрокаДвижений.ДокументСписания    				= Ссылка; 	
	//СтрокаДвижений.СтатьяДвиженияДенежныхСредств 	= СтатьяДвиженияДенежныхСредств;
	//
	//Движения.ДенежныеСредстваКСписанию.мПериод          = Дата;
	//Движения.ДенежныеСредстваКСписанию.мТаблицаДвижений = ТаблицаДенежныеСредстваКСписанию;
	//Движения.ДенежныеСредстваКСписанию.ВыполнитьПриход();
							
	Если Оплачено Тогда
		
		// По регистру "Упр Денежные средства"
		
		ТаблицаДенежныеСредства = Движения.УпрДенежныеСредства.ВыгрузитьКолонки();

		СтрокаДвижений = ТаблицаДенежныеСредства.Добавить();
		
		СтрокаДвижений.Организация         = ОрганизацияОтправитель;
		СтрокаДвижений.БанковскийСчетКасса = Касса;
		СтрокаДвижений.ВидДенежныхСредств  = Перечисления.ВидыДенежныхСредств.Наличные;
		СтрокаДвижений.Сумма               = СуммаОтправлено;
		СтрокаДвижений.СуммаУпр    		   = СуммаУпрОтправлено;
		СтрокаДвижений.Активность		   = Истина;
		СтрокаДвижений.ВидДвижения         = ВидДвиженияНакопления.Расход;
		СтрокаДвижений.Период              = Дата;
		
		СтрокаДвижений = ТаблицаДенежныеСредства.Добавить();
		
		СтрокаДвижений.Организация         = ОрганизацияПолучатель;
		СтрокаДвижений.БанковскийСчетКасса = КассаПолучатель;
		СтрокаДвижений.ВидДенежныхСредств  = Перечисления.ВидыДенежныхСредств.Наличные;
		СтрокаДвижений.Сумма               = СуммаПолучено;
		СтрокаДвижений.СуммаУпр    		   = СуммаУпрПолучено;
		СтрокаДвижений.Активность		   = Истина;
		СтрокаДвижений.ВидДвижения         = ВидДвиженияНакопления.Приход;
		СтрокаДвижений.Период              = Дата;

		Движения.УпрДенежныеСредства.мТаблицаДвижений = ТаблицаДенежныеСредства;
		Движения.УпрДенежныеСредства.ВыполнитьДвижения();
		
		// По регистру "Денежные средства к получению"
		
		//ТаблицаДенежныеСредстваКПолучению = Движения.ДенежныеСредстваКПолучению.ВыгрузитьКолонки();

		//СтрокаДвижений = ТаблицаДенежныеСредстваКПолучению.Добавить();
		//
		//СтрокаДвижений.Организация         				= ОрганизацияПолучатель;
		//СтрокаДвижений.БанковскийСчетКасса 				= КассаПолучатель;
		//СтрокаДвижений.ВидДенежныхСредств  				= Перечисления.ВидыДенежныхСредств.Наличные;
		//СтрокаДвижений.Сумма               				= СуммаДокумента;
		//СтрокаДвижений.СуммаУпр            				= СуммаУпр;
		//СтрокаДвижений.ДокументПолучения   				= Ссылка;
		//СтрокаДвижений.СтатьяДвиженияДенежныхСредств 	= СтатьяДвиженияДенежныхСредств;
		//
		//Движения.ДенежныеСредстваКПолучению.мПериод          = Дата;
		//Движения.ДенежныеСредстваКПолучению.мТаблицаДвижений = ТаблицаДенежныеСредстваКПолучению;
		//Движения.ДенежныеСредстваКПолучению.ВыполнитьРасход();
		
		// По регистру "Денежные средства к списанию"
		
		//ТаблицаДенежныеСредстваКСписанию = Движения.ДенежныеСредстваКСписанию.ВыгрузитьКолонки();

		//СтрокаДвижений = ТаблицаДенежныеСредстваКСписанию.Добавить();
		//
		//СтрокаДвижений.Организация         				= ОрганизацияОтправитель;
		//СтрокаДвижений.БанковскийСчетКасса 				= Касса;
		//СтрокаДвижений.ВидДенежныхСредств  				= Перечисления.ВидыДенежныхСредств.Наличные;
		//СтрокаДвижений.Сумма               				= СуммаДокумента;
		//СтрокаДвижений.ДокументСписания    				= Ссылка;
		//СтрокаДвижений.СтатьяДвиженияДенежныхСредств 	= СтатьяДвиженияДенежныхСредств;
		//
		//Движения.ДенежныеСредстваКСписанию.мПериод          = Дата;
		//Движения.ДенежныеСредстваКСписанию.мТаблицаДвижений = ТаблицаДенежныеСредстваКСписанию;
		//Движения.ДенежныеСредстваКСписанию.ВыполнитьРасход();
		//
		// По регистру "Движения денежных средств"
		
		ТаблицаДвиженияДенежныхСредств = Движения.УпрДвиженияДенежныхСредств.ВыгрузитьКолонки();
		
		СтрокаДвижение = ТаблицаДвиженияДенежныхСредств.Добавить();
		
		СтрокаДвижение.ВидДенежныхСредств            = Перечисления.ВидыДенежныхСредств.Наличные;
		СтрокаДвижение.ПриходРасход                  = Перечисления.ВидыДвиженийПриходРасход.Расход;
		СтрокаДвижение.БанковскийСчетКасса           = Касса;
		СтрокаДвижение.Организация                   = Касса.Владелец;
		СтрокаДвижение.ДокументДвижения              = Ссылка;
		СтрокаДвижение.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств;
		//СтрокаДвижение.Сумма                         = СуммаДокумента;
		СтрокаДвижение.Сумма                         = СуммаОтправлено;
		СтрокаДвижение.СуммаУпр                      = СуммаУпрОтправлено;
		
		СтрокаДвижение = ТаблицаДвиженияДенежныхСредств.Добавить();
		
		СтрокаДвижение.ВидДенежныхСредств            = Перечисления.ВидыДенежныхСредств.Наличные;
		СтрокаДвижение.ПриходРасход                  = Перечисления.ВидыДвиженийПриходРасход.Приход;
		СтрокаДвижение.БанковскийСчетКасса           = КассаПолучатель;
		СтрокаДвижение.Организация 	                 = КассаПолучатель.Владелец;
		СтрокаДвижение.ДокументДвижения              = Ссылка;
		СтрокаДвижение.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств;
		//СтрокаДвижение.Сумма                         = СуммаДокумента;
		СтрокаДвижение.Сумма                         = СуммаПолучено;
		СтрокаДвижение.СуммаУпр                      = СуммаУпрПолучено;
		
		Движения.УпрДвиженияДенежныхСредств.мПериод          = КонецДня(Дата);
		Движения.УпрДвиженияДенежныхСредств.мТаблицаДвижений = ТаблицаДвиженияДенежныхСредств;
		Движения.УпрДвиженияДенежныхСредств.ВыполнитьДвижения();
		
	КонецЕсли;
	
	
	// Бухгалтерские проводки документа
	ПроводкиБУ         = Движения.Хозрасчетный;
	
	Если Касса.ВалютаДенежныхСредств = Константы.ВалютаРегламентированногоУчета.Получить() Тогда 
		СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("333");
		СчетКТ = ПланыСчетов.Хозрасчетный.НайтиПоКоду("301");
		Проводка = ПроводкиБУ.Добавить();
		Проводка.Период      = Дата;
		Проводка.Организация = ОрганизацияОтправитель;
		Проводка.Содержание  = "Обмен валют";
		Проводка.Сумма 		 = СуммаОтправлено; 
		
		Проводка.СчетДт      = СчетДт;
		Проводка.СчетКт      = СчетКТ;
	Иначе
		СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("334");
		СчетКТ = ПланыСчетов.Хозрасчетный.НайтиПоКоду("302");
		Проводка = ПроводкиБУ.Добавить();
		Проводка.Период      = Дата;
		Проводка.Организация = ОрганизацияОтправитель;
		Проводка.Содержание  = "Обмен валют";
		Проводка.Сумма 		 = СуммаПолучено;
		Проводка.ВалютнаяСуммаДт = СуммаОтправлено;
		Проводка.ВалютнаяСуммаКт = СуммаОтправлено;
		Проводка.ВалютаДт    = Касса.ВалютаДенежныхСредств;
		Проводка.ВалютаКт    = Касса.ВалютаДенежныхСредств;
		Проводка.СчетДт      = СчетДт;
		Проводка.СчетКт      = СчетКТ;
		
	КонецЕсли;	
	
	
	
	
	
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтатьяДвиженияДенежныхСредств);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Касса.ОбособленноеПодразделение);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, Справочники.Подразделения.НайтиПоКоду("000000183"));
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 4, Справочники.Проекты.НайтиПоКоду("000000131"));
	
	
	Если Касса.ВалютаДенежныхСредств = Константы.ВалютаРегламентированногоУчета.Получить() Тогда 
		СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("334");
		СчетКТ = ПланыСчетов.Хозрасчетный.НайтиПоКоду("333");
		
		Проводка = ПроводкиБУ.Добавить();
		Проводка.Период      			 = Дата;
		Проводка.Организация 			 = ОрганизацияОтправитель;
		Проводка.Содержание  			 = "Обмен валют";
		Проводка.Сумма 		 			 = СуммаОтправлено;
		Проводка.ВалютнаяСуммаДт 		 = СуммаПолучено;
		Проводка.ВалютаДт 		 		 = КассаПолучатель.ВалютаДенежныхСредств;
		
		Проводка.СчетДт      = СчетДт;
		Проводка.СчетКт      = СчетКТ;

	Иначе
		СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("333");
		СчетКТ = ПланыСчетов.Хозрасчетный.НайтиПоКоду("334");
		
		Проводка = ПроводкиБУ.Добавить();
		Проводка.Период      			 = Дата;
		Проводка.Организация 			 = ОрганизацияОтправитель;
		Проводка.Содержание  			 = "Обмен валют";
		Проводка.Сумма 		 			 = СуммаПолучено;
		Проводка.ВалютнаяСуммаКТ 		 = СуммаОтправлено;
		Проводка.ВалютаКт 		 		 = Касса.ВалютаДенежныхСредств;
		
		Проводка.СчетДт      = СчетДт;
		Проводка.СчетКт      = СчетКТ;

	КонецЕсли;
	
		
	
	Если Касса.ВалютаДенежныхСредств = Константы.ВалютаРегламентированногоУчета.Получить() Тогда 
		СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("302");
		СчетКТ = ПланыСчетов.Хозрасчетный.НайтиПоКоду("334");
			
		Проводка = ПроводкиБУ.Добавить();
		Проводка.Период      			 = Дата;
		Проводка.Организация 			 = ОрганизацияОтправитель;
		Проводка.Содержание  			 = "Обмен валют";
		Проводка.Сумма 					 = СуммаОтправлено;
		Проводка.ВалютнаяСуммаДт 		 = СуммаПолучено;
		Проводка.ВалютнаяСуммаКТ 		 = СуммаПолучено;
		Проводка.ВалютаДт 				 = КассаПолучатель.ВалютаДенежныхСредств;
		Проводка.ВалютаКТ 				 = КассаПолучатель.ВалютаДенежныхСредств;
	Иначе
		СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("301");
		СчетКТ = ПланыСчетов.Хозрасчетный.НайтиПоКоду("333");
		
		Проводка = ПроводкиБУ.Добавить();
		Проводка.Период      = Дата;
		Проводка.Организация = ОрганизацияОтправитель;
		Проводка.Содержание  = "Обмен валют";
		Проводка.Сумма 		 = СуммаПолучено;
	КонецЕсли;

		
	Проводка.СчетДт      = СчетДт;
	Проводка.СчетКт      = СчетКТ;
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтатьяДвиженияДенежныхСредств);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, КассаПолучатель.ОбособленноеПодразделение);
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Справочники.Подразделения.НайтиПоКоду("000000183"));
	ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 4, Справочники.Проекты.НайтиПоКоду("000000131"));
	
	
	//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Строка.СхемаРеализации.СубконтоВычетовИзДоходов1);
	//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Строка.СхемаРеализации.СубконтоВычетовИзДоходов2);
	//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Строка.СхемаРеализации.СубконтоВычетовИзДоходов3);
	//ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", Строка.НоменклатурнаяГруппа);
	
	
КонецПроцедуры// ДвиженияПоРегистрам()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;

	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаОтправлено,Дата);
	КурсДокумента      = СтруктураКурсаДокумента.Курс;
	КратностьДокумента = СтруктураКурсаДокумента.Кратность;
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей(), Отказ, Заголовок);
	
	// Проверяем соответствие организаций - отправителя и получателя,
	// если хотя бы одна организация отражается в регл.учете
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеДенег.Ссылка
	|ИЗ
	|	Документ.ВнутреннееПеремещениеНаличныхДенежныхСредств КАК ПеремещениеДенег
	|ГДЕ
	|	ПеремещениеДенег.Ссылка = &Ссылка
	|	И ПеремещениеДенег.ОрганизацияОтправитель <> ПеремещениеДенег.ОрганизацияПолучатель";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ОрганизацииНеСовпадают = НЕ Запрос.Выполнить().Пустой();
	
	Если ОрганизацииНеСовпадают Тогда
		ТекстСообщения = НСтр("ru='Перемещения наличных между разными организациями, если хотя бы одна из них отражается в регламентированном учете,"
"	следует оформлять парой документов ""Приходный кассовый ордер"" и ""Расходный кассовый ордер""';uk='Переміщення готівки між різними організаціями, якщо хоча б одна з них відображається в регламентованому обліку,"
"	слід оформляти парою документів ""Прибутковий касовий ордер"" і ""Видатковий касовий ордер""'");
		ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
	КонецЕсли;
		
	Если НЕ Отказ И НЕ Оплачено И РежимПроведения=РежимПроведенияДокумента.Оперативный Тогда
		
		// Проверяем остаток доступных денежных средств
		СвободныйОстатокОтправлено = УправлениеДенежнымиСредствами.ПолучитьСвободныйОстатокДС(Касса,Дата,);
		
		Если СвободныйОстатокОтправлено < СуммаОтправлено Тогда
			
			Сообщить(Заголовок+НСтр("ru='"
"Сумма документа превышает возможный к использованию остаток денежных средств"
"по ';uk='"
"Сума документа перевищує можливий до використання залишок грошових коштів"
"по '") + Касса.Наименование + НСтр("ru='."
"Возможный к использованию остаток: ';uk='."
//"Можливий до використання залишок: '") + Формат(СвободныйОстатокОтправлено,"ЧЦ=15; ЧДЦ=2")+" "+ВалютаДокумента+НСтр("ru='"
"Можливий до використання залишок: '") + Формат(СвободныйОстатокОтправлено,"ЧЦ=15; ЧДЦ=2")+" "+Касса.ВалютаДенежныхСредств+НСтр("ru='"
"Сумма документа = ';uk='"
"Сума документа = '")+Формат(СуммаОтправлено,"ЧЦ=15; ЧДЦ=2")+" "+Касса.ВалютаДенежныхСредств);
//"Сума документа = '")+Формат(СуммаОтправлено,"ЧЦ=15; ЧДЦ=2")+" "+ВалютаДокумента);
			
			Если НЕ УправлениеДенежнымиСредствами.ЕстьРазрешениеПревышатьСвободныйОстатокДС() Тогда
				Отказ = Истина;
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если Не Отказ Тогда
		
		СтруктураГруппаВалют = Новый Структура;
		СтруктураГруппаВалют.Вставить("ВалютаУпрУчета",глЗначениеПеременной("ВалютаУправленческогоУчета").Код);
		СтруктураГруппаВалют.Вставить("ВалютаОтправлено",ВалютаОтправлено.Код);
		СтруктураГруппаВалют.Вставить("ВалютаПолучено",ВалютаПолучено.Код);
		СтруктураКурсыВалют=УправлениеДенежнымиСредствами.ПолучитьКурсыДляГруппыВалют(СтруктураГруппаВалют,Дата);
		
		ДвиженияПоРегистрам(СтруктураКурсыВалют);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры
